yuplus/nxp-mcx-series/MCXE247/periph0/PERI_SIM.h
#define SIM_MISCTRL0_FTM0_OBE_CTRL_MASK          (0x10000U)
#define SIM_MISCTRL0_FTM0_OBE_CTRL_SHIFT         (16U)
/*! FTM0_OBE_CTRL - FTM0 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM.MODE[FAULTM]!=2'b00 and FTM.FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM.SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM0_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM0_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM0_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM1_OBE_CTRL_MASK          (0x20000U)
#define SIM_MISCTRL0_FTM1_OBE_CTRL_SHIFT         (17U)
/*! FTM1_OBE_CTRL - FTM1 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM.MODE[FAULTM]!=2'b00 and FTM.FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM.SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM1_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM1_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM1_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM2_OBE_CTRL_MASK          (0x40000U)
#define SIM_MISCTRL0_FTM2_OBE_CTRL_SHIFT         (18U)
/*! FTM2_OBE_CTRL - FTM2 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM.MODE[FAULTM]!=2'b00 and FTM.FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM.SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM2_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM2_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM2_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM3_OBE_CTRL_MASK          (0x80000U)
#define SIM_MISCTRL0_FTM3_OBE_CTRL_SHIFT         (19U)
/*! FTM3_OBE_CTRL - FTM3 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM.MODE[FAULTM]!=2'b00 and FTM.FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM.SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM3_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM3_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM3_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM4_OBE_CTRL_MASK          (0x100000U)
#define SIM_MISCTRL0_FTM4_OBE_CTRL_SHIFT         (20U)
/*! FTM4_OBE_CTRL - FTM4 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM_MODE[FAULTM]!=2'b00 and FTM_FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM_SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM4_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM4_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM4_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM5_OBE_CTRL_MASK          (0x200000U)
#define SIM_MISCTRL0_FTM5_OBE_CTRL_SHIFT         (21U)
/*! FTM5_OBE_CTRL - FTM5 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM_MODE[FAULTM]!=2'b00 and FTM_FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM_SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM5_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM5_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM5_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM6_OBE_CTRL_MASK          (0x400000U)
#define SIM_MISCTRL0_FTM6_OBE_CTRL_SHIFT         (22U)
/*! FTM6_OBE_CTRL - FTM6 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM_MODE[FAULTM]!=2'b00 and FTM_FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM_SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM6_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM6_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM6_OBE_CTRL_MASK)

#define SIM_MISCTRL0_FTM7_OBE_CTRL_MASK          (0x800000U)
#define SIM_MISCTRL0_FTM7_OBE_CTRL_SHIFT         (23U)
/*! FTM7_OBE_CTRL - FTM7 OBE CTRL bit
 *  0b0..The FTM channel output is put to safe state when the FTM counter is enabled and the FTM channel output is
 *       enabled by Fault Control (FTM_MODE[FAULTM]!=2'b00 and FTM_FLTCTRL[FSTATE]=1'b0) and PWM is enabled
 *       (FTM_SC[PWMENn] = 1'b1). Otherwise the channel output is tristated.
 *  0b1..The FTM channel output state is retained when the channel is in output mode. The output channel is
 *       tristated when the channel is in input capture [DECAPEN=1'b0, COMBINE=1'b0, MSnB:MSnA=2'b00] or dual edge
 *       capture mode [DECAPEN=1'b1].
 */
#define SIM_MISCTRL0_FTM7_OBE_CTRL(x)            (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_FTM7_OBE_CTRL_SHIFT)) & SIM_MISCTRL0_FTM7_OBE_CTRL_MASK)

#define SIM_MISCTRL0_RMII_CLK_OBE_MASK           (0x1000000U)
#define SIM_MISCTRL0_RMII_CLK_OBE_SHIFT          (24U)
/*! RMII_CLK_OBE - RMII CLK OBE bit */
#define SIM_MISCTRL0_RMII_CLK_OBE(x)             (((uint32_t)(((uint32_t)(x)) << SIM_MISCTRL0_RMII_CLK_OBE_SHIFT)) & SIM_MISCTRL0_RMII_CLK_OBE_MASK)

